app/controllers/content_controller.rb

SELECT  "themes".* FROM "themes" WHERE "themes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "head_lines".* FROM "head_lines" WHERE "head_lines"."theme_id" = $1 ORDER BY created_at ASC LIMIT $2  [["theme_id", 2], ["LIMIT", 5]]
SELECT  "themes".* FROM "themes" ORDER BY created_at ASC, score ASC LIMIT $1  [["LIMIT", 5]]
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."theme_id" = $1 ORDER BY created_at ASC LIMIT $2  [["theme_id", 2], ["LIMIT", 5]]
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def view
if (params[:t]) != nil
    @theme = Theme.find(params[:t])
@top = @theme.head_lines.sorted.first(5)
@subs = @theme.subjects.sorted.first(5)
else
@theme = Theme.sorted
end


if (params[:s]) != nil
    @subs = Subject.find(params[:s])

INSERT INTO "head_lines" ("created_at", "updated_at", "text", "image") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", 2017-02-02 07:46:56 UTC], ["updated_at", 2017-02-02 07:46:56 UTC], ["text", "hi"], ["image", "n36701566_30510554_5655.jpg"]]
SELECT COUNT(*) FROM "subjects" WHERE "subjects"."text" = $1  [["text", "ggg"]]
INSERT INTO "subjects" ("created_at", "updated_at", "name") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", 2017-01-02 17:12:26 UTC], ["updated_at", 2017-01-02 17:12:26 UTC], ["name", "[\"plop\"]"]]
SELECT COUNT(*) FROM "themes" WHERE "themes"."text" = $1  [["text", "iii"]]
INSERT INTO "themes" ("created_at", "updated_at", "name") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", 2017-01-20 15:30:15 UTC], ["updated_at", 2017-01-20 15:30:15 UTC], ["name", "ttree"]]
---
def create

@head = HeadLine.new(head_params)
    if @head.save

subjects = @head.text.scan(/@([a-z0-9_]+)/i)
subjects.each do |s|
z = s.to_s
z[0...2]=''
h = z.length
z[(h-2)...(h)]=''
if Subject.where(:text => z).empty?
newsub = Subject.new(:text=> z)
newsub.save
else
end
end

subjects = @head.text.scan(/#([a-z0-9_]+)/i)
subjects.each do |s|
  z = s.to_s
z[0...2]=''
h = z.length
z[(h-2)...(h)]=''
if Theme.where(:text=> z).empty?
newsub = Theme.new(:text=> z)
newsub.save

SELECT  "head_lines".* FROM "head_lines" WHERE "head_lines"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
def selecthead
@selected = HeadLine.find(params[:id])

SELECT  "themes".* FROM "themes" WHERE "themes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
def selecttheme
@selected = Theme.find(params[:id])

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
def selectsub
@selected = Subject.find(params[:id])

SELECT  "head_lines".* FROM "head_lines" WHERE "head_lines"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
def contentadd
@headlines = HeadLine.find(params[:id])

SELECT  "head_lines".* FROM "head_lines" WHERE "head_lines"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "contents" ("created_at", "updated_at", "text", "place", "image") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", 2017-02-02 07:48:57 UTC], ["updated_at", 2017-02-02 07:48:57 UTC], ["text", "next"], ["place", 0], ["image", "n36701566_30511001_8180.jpg"]]
SELECT COUNT(*) FROM "subjects" WHERE "subjects"."text" = $1  [["text", "trump"]]
INSERT INTO "subjects" ("created_at", "updated_at", "text") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", 2017-01-30 15:00:07 UTC], ["updated_at", 2017-01-30 15:00:07 UTC], ["text", "trump"]]
---
def add
  @headlines = HeadLine.find(params[:headline])
  @content = Content.new(content_params)
  @content.place = (params[:place]).to_i
  @content.save
  @headlines.contents << @content

    if @content.save

     subjects = @content.text.scan(/@([a-z0-9_]+)/i)
subjects.each do |s|
  z = s.to_s
z[0...2]=''
h = z.length
z[(h-2)...(h)]=''

if Subject.where(:text => z).empty?
newsub = Subject.new(:text=> z)
newsub.save

SELECT  "head_lines".* FROM "head_lines" WHERE "head_lines"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "contents" SET "score" = $1, "updated_at" = $2 WHERE "contents"."id" = $3  [["score", 1], ["updated_at", 2017-01-20 15:12:54 UTC], ["id", 1]]
UPDATE "head_lines" SET "score" = $1, "updated_at" = $2 WHERE "head_lines"."id" = $3  [["score", 1], ["updated_at", 2017-01-20 15:12:54 UTC], ["id", 1]]
SELECT "contents".* FROM "contents" WHERE "contents"."head_line_id" = $1 ORDER BY place DESC  [["head_line_id", 1]]
---
def contentup
@content = HeadLine.find(params[:head])
@content.score = @content.score + 1
@content.save

@content = Content.find(params[:id])

SELECT  "contents".* FROM "contents" WHERE "contents"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "contents" SET "score" = $1, "updated_at" = $2 WHERE "contents"."id" = $3  [["score", 3], ["updated_at", 2017-01-20 15:15:20 UTC], ["id", 1]]
SELECT  "head_lines".* FROM "head_lines" WHERE "head_lines"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "contents".* FROM "contents" WHERE "contents"."head_line_id" = $1 ORDER BY place DESC  [["head_line_id", 1]]
UPDATE "head_lines" SET "score" = $1, "updated_at" = $2 WHERE "head_lines"."id" = $3  [["score", 3], ["updated_at", 2017-01-20 15:15:20 UTC], ["id", 1]]
---
def contentdown
@content = Content.find(params[:id])
@content.score = @content.score - 1
@content.save

@content = HeadLine.find(params[:head])
@content.score = @content.score - 1
@content.save

SELECT  "themes".* FROM "themes" WHERE "themes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
def themeadd
@theme = Theme.find(params[:id])

SELECT  "themes".* FROM "themes" WHERE "themes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "head_lines" ("created_at", "updated_at", "text") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", 2017-01-27 13:33:54 UTC], ["updated_at", 2017-01-27 13:33:54 UTC], ["text", "cous"]]
---
def tadd
  @theme = Theme.find(params[:theme])
  @headline = HeadLine.new(head_params)

  @headline.save

SELECT  "head_lines".* FROM "head_lines" WHERE "head_lines"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "head_lines" SET "score" = $1, "updated_at" = $2 WHERE "head_lines"."id" = $3  [["score", 1], ["updated_at", 2017-01-27 13:00:42 UTC], ["id", 1]]
SELECT  "themes".* FROM "themes" WHERE "themes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "head_lines".* FROM "head_lines" WHERE "head_lines"."theme_id" = $1 ORDER BY created_at ASC  [["theme_id", 1]]
UPDATE "themes" SET "score" = $1, "updated_at" = $2 WHERE "themes"."id" = $3  [["score", 1], ["updated_at", 2017-01-27 13:00:42 UTC], ["id", 1]]
---
def themeup
 @content = HeadLine.find(params[:id])
@content.score = @content.score + 1
@content.save

@content = Theme.find(params[:theme])
@content.score = @content.score + 1
@content.save

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
def subjectadd
@subject = Subject.find(params[:id])

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "head_lines" ("created_at", "updated_at", "text") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", 2017-01-30 17:04:51 UTC], ["updated_at", 2017-01-30 17:04:51 UTC], ["text", "gg"]]
---
def sadd
  @subject = Subject.find(params[:subject])
  @headline = HeadLine.new(head_params)

  @headline.save

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
UPDATE "subjects" SET "score" = $1, "updated_at" = $2 WHERE "subjects"."id" = $3  [["score", -1], ["updated_at", 2017-01-30 17:15:10 UTC], ["id", 2]]
SELECT  "head_lines".* FROM "head_lines" WHERE "head_lines"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
UPDATE "head_lines" SET "score" = $1, "updated_at" = $2 WHERE "head_lines"."id" = $3  [["score", 1], ["updated_at", 2017-01-30 17:05:50 UTC], ["id", 33]]
---
def subjectup
@content = Subject.find(params[:head])
@selected = Subject.find(params[:head])
@content.score = @content.score + 1
@content.save

@content = HeadLine.find(params[:id])
@content.score = @content.score + 1
@content.save

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "subjects" SET "score" = $1, "updated_at" = $2 WHERE "subjects"."id" = $3  [["score", -5], ["updated_at", 2017-01-30 17:16:44 UTC], ["id", 2]]
SELECT  "head_lines".* FROM "head_lines" WHERE "head_lines"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
UPDATE "head_lines" SET "score" = $1, "updated_at" = $2 WHERE "head_lines"."id" = $3  [["score", -4], ["updated_at", 2017-01-30 17:16:44 UTC], ["id", 33]]
---
def subjectdown
@content = Subject.find(params[:head])
@selected = Subject.find(params[:head])
@content.score = @content.score - 1
@content.save

@content = HeadLine.find(params[:id])
@content.score = @content.score - 1
@content.save

INSERT INTO "users" ("email", "username", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def creatu
    @users = User.new(user_params)
    if @users.save

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["username", "n"], ["LIMIT", 1]]
---
def attempt_login
if params[:username].present? && params[:password].present?

  found_user = User.where(:username => params[:username]).first