app/controllers/content_controller.rb

def create

@head = HeadLine.new(head_params)
    if @head.save
     redirect_to(:controller => 'content', :action => 'view')
     subjects = @head.text.scan(/@([a-z0-9_]+)/i)
subjects.each do |s|
	z = s.to_s
z[0...2]=''
h = z.length
z[(h-2)...(h)]=''

if Subject.where(:name=> z).empty?
---
SELECT COUNT(*) FROM "subjects" WHERE "subjects"."name" IS NULL