app/views/content/selected.erb


  <% if @selected.head_lines.empty? %>
---
SELECT  "head_lines".* FROM "head_lines" ORDER BY created_at ASC, score ASC LIMIT $1  [["LIMIT", 1]]